{
"capstone":
[
{
    "name":"Nothing",
    "hp":0,
    "sp":0,
    "cp":0,
    "speed":0,
    "data":[]
},
{
    "name":"Bloodlust",
    "hp":4,
    "sp":0,
    "cp":0,
    "speed":0,
    "data":["[Battle Fuel]: When you drop a creature to 0 HP, gain 2 HP and 1 CP.","[Field Practice]: All melee attacks deal double damage."]
},
{
    "name":"Paladin",
    "hp":0,
    "sp":0,
    "cp":3,
    "ac":1,
    "speed":0,
    "data":["[Rending Smite - 2 CP]: On a successful melee attack, the creature will take an additional 1d6 of the same damage.","[Vengeful Guardian]: When an ally within 60 ft of you is knocked into critical condition, immediately take a turn restoring all your SP."]
},
{
    "name":"Generator",
    "hp":2,
    "sp":2,
    "cp":0,
    "speed":0,
    "data":["[Paradoxal Packing]: You no longer need to pay for upkeep.","[Temporal Rationing]: When you use a grenade, ration, or consumable roll 1d6. On a 5+ the item is not consumed when used."]
},
{
    "name":"Slayer",
    "hp":1,
    "sp":2,
    "cp":0,
    "speed":10,
    "data":["[Exploiter]: All melee attacks ignore resistances.","[Slayer’s Mark]: Every short rest you may mark a creature. When this creature is defeated, regain TP equal to half your max HP, and mark a new creature."]
},
{
    "name":"Brutalist",
    "hp":2,
    "sp":0,
    "cp":2,
    "speed":0,
    "data":["[Corpse Beater - 1 CP]: Grab a creature that has perished or is in critical condition, and deal 2 Major bludgeoning damage to a target within 10 ft of you. The corpse is destroyed after use.","[Brutalizer]: When a creature drops to 0 HP, they are brutalized and all creatures in a 15 ft radius must make a Smarts check of 4+ or gain the Scared Condition for 1 turn."]
},
{
    "name":"Surefire",
    "hp":0,
    "sp":3,
    "cp":1,
    "speed":0,
    "data":["[Steady Hands]: At the cost of 2 Faults, your next ranged attack will deal double damage.","[Trained Eye]: Once per short rest, deal triple damage on a successful ranged attack."]
},
{
    "name":"Blitz",
    "hp":0,
    "sp":3,
    "cp":1,
    "speed":0,
    "data":["[Quick Draw]: Your first ranged attack in combat will deal triple damage, gain 2 Prowess, and ignore resistances.","[Rapid Fire]: Reduce the cost of a ranged attack by 1 SP, but take 2 Faults. This ability may not be used on attacks that only cost 1 SP."]
}
]
}