{
"perk":
[
{
    "name":"Nothing",
    "hp":0,
    "sp":0,
    "cp":0,
    "speed":0,
    "data":[]
},
{
    "name":"Scout",
    "hp":2,
    "sp":0,
    "cp":2,
    "speed":0,
    "data":["[Vitals - 1 CP]: Learn the exact hitpoints, and AC of a target that you can see within 60 ft.","[Know Your Enemy - 1 CP]: Know the weaknesses and resistances of a target that you can see within 60 ft.","[Crowd Sense]: You always know how many creatures are within 30 ft of you, and you cannot be surprised."]
},
{
    "name":"Martial Adept",
    "hp":3,
    "sp":0,
    "cp":1,
    "speed":0,
    "data":["[Retort - 1 CP]: When an enemy misses a melee attack, you may take a reaction to make a melee attack against the creature ignoring the attacker’s AC.","[Disarm - 1 CP]: When an enemy misses a melee attack, you may take a reaction to disarm them and take their weapon."]
},
{
    "name":"Tracker",
    "hp":3,
    "sp":1,
    "cp":0,
    "speed":0,
    "data":["[Quarry]: Once per long rest you may pick a creature to track that has left tracks or evidence of its existence. When this creature is killed or captured, you may pick a new target. This effect lasts until a new creature is picked.","[Tracking Sense]: When you are within 30 ft of your target, you will know the general direction of them.","[Hunter]: Gain 1 Prowess when attacking your target."]
},
{
    "name":"Wanderer",
    "hp":2,
    "sp":1,
    "cp":0,
    "speed":0,
    "talent":1,
    "data":["[Barter Expert]: Once per long rest you may half the price of an object.","[Judge of Character]: Gain 2 Prowess when discerning the true intentions of a creature.","[Utilitarian]: Upkeep cost is reduced by half."]
},
{
    "name":"Ruffian",
    "hp":2,
    "sp":1,
    "cp":0,
    "speed":10,
    "data":["[Slippery]: Enemies that attempt to grapple you gain 1 Fault.","[Lucky]: Once per long rest you may reroll a check and take the higher of the 2 outcomes."]
},
{
    "name":"Scholar",
    "hp":2,
    "sp":0,
    "cp":0,
    "speed":0,
    "talent":2,
    "data":["[Sense of Direction]: You always know what direction is north.","[Keen Memory]: You can recall any information given to you in the last month."]
},
{
    "name":"Adrenaline Junky",
    "hp":4,
    "sp":0,
    "cp":0,
    "speed":0,
    "data":["[Reckless Jolt - 1 HP]: Gain 1 SP.","[Blood Shield - 1 HP]: Gain 1 AC until the start of your next turn."]
},
{
    "name":"Blight Bearer",
    "hp":1,
    "sp":0,
    "cp":2,
    "speed":0,
    "talent":1,
    "data":["[Blight Harbinger]: You are immune to blight damage and are immune to disease.","[Blight Spreader]: When you crit with a melee attack, you may turn the damage type into blight damage."]
},
{
    "name":"Survivor",
    "hp":3,
    "sp":0,
    "cp":1,
    "speed":0,
    "data":["[Patch Up - 1 CP]: Heal yourself 1d4 HP.","[Surrounded]: If there are 2 or more enemies within 5 ft of you, you gain 1 AC."]
},
{
    "name":"Olympian",
    "hp":2,
    "sp":1,
    "cp":1,
    "speed":10,
    "data":["[Long Winded - 1 CP]: Double your movement speed for 1 hour.","[Surge]: Regain all SP and CP. You can do this once per long rest."]
},
{
    "name":"Beast Master",
    "hp":0,
    "sp":0,
    "cp":0,
    "speed":0,
    "data":["[Beast Companion]: Gain a creature that is danger level 2 or lower, and must be natural to the planet you reside on. The creature in combat will be after you in initiative. The creature will perform any action you tell it to, even if it would harm it. If the creature is killed or lost, at the end of a long rest roll a 6, on the result of a 6, tame a new creature."]
},
{
    "name":"Battle Worn",
    "hp":4,
    "sp":0,
    "cp":0,
    "speed":0,
    "data":["[Leather Skin]: Gain resistance to laser damage."]
},
{
    "name":"Overwatch",
    "hp":2,
    "sp":1,
    "cp":1,
    "speed":0,
    "data":["[Battle Survey - 1 CP]: Give 3 creatures that you can see within 60 ft, the marked condition. This condition lasts until the start of your next turn.","[Cover Sniper]: You ignore the benefits of half and ¾ cover."]
},
{
    "name":"Prepper",
    "hp":2,
    "sp":0,
    "cp":2,
    "speed":0,
    "data":["[Skeleton Key - 1 CP]: Succeed on a hack or a lockpick with a difficulty rating lower than Master.","[Master Toolkit - 1 CP]: Your next repair will heal double the HP it normally would."]
}
]
}