{
"training":
[
{
    "name":"Nothing",
    "hp":0,
    "sp":0,
    "cp":0,
    "speed":0,
    "thresholds":[0,0,0],
    "data":[]
},
{
    "name":"Tactician",
    "hp":4,
    "sp":2,
    "cp":4,
    "speed":0,
    "thresholds":[0,1,1],
    "data":["[Commanding Presence - 1 CP; 30ft; Sight]: Give a creature SP equal to your level, no greater than their max. The creature may then immediately use any actions that are free or require an SP cost until they no longer have any additional SP to use. At level 7 if you use this ability on a creature in critical condition, you may bring them back to 1 HP at the cost of 1 additional CP.","[Pinpoint Weaknesses - 2 CP; 60ft; Sight]: Pick 1 effect to apply to a creature: Give the marked condition for 1 hour, give the weakened condition for 1 hour, and give 2 Faults to their next attack. At level 5 you may pick 2 effects.","[Field Domination; 30ft; Sight]: Once per long rest, when a creature rolls, you may choose to force the creature to reroll, then you may choose between the two outcomes. At level 3 you may do this twice, and at level 7 you may do this three times."]
},
{
    "name":"Gunslinger",
    "hp":4,
    "sp":3,
    "cp":3,
    "speed":0,
    "thresholds":[1,1,0],
    "data":["[Trick Shot - 1 CP; Ranged]: On a successful attack pick 1 of these effects to apply to the shot: Give the target the crippled condition for 1 turn, give the blind condition for 1 turn, ignore cover. At level 5 you may pick 2 effects.","[Bouncing Shot - 1 CP; Ranged]: On a successful ranged attack, you may use this ability to make an additional attack on a creature within 30 ft of your target with the same ranged attack.","[Nimble]: Always start at the beginning of initiative. At level 4, your first action in combat will cost no SP or CP. At level 7, your first action on your turn will cost no SP."]
},
{
    "name":"Brawler",
    "hp":5,
    "sp":2,
    "cp":3,
    "speed":5,
    "thresholds":[1,0,1],
    "data":["[Fast Reflexes - 1 CP]: As a response, you may negate any ranged attack that you could see coming.","[Brutal Strike - 1 CP; Melee]: On a successful melee attack, double the damage result. At level 15 a 5ft shockwave emit from all your melee attacks, all hostile creatures within range must succeed on an Anger check higher than your Anger skill or take damage equal to the damage result.","[Martial Training]: When an enemy chooses to move out of your melee range, you may make a single melee attack without expending additional SP. At level 4 you now ignore resistances when making melee attacks."]
},
{
    "name":"Field Medic",
    "hp":3,
    "sp":2,
    "cp":5,
    "speed":10,
    "thresholds":[0,1,1],
    "data":["[Cleanse - 1 CP; Touch]: Remove 1 condition from them. At level 4 you may remove 2 conditions. At level 7 all conditions of your choice may be removed.","[Medical Aid - 1 CP; Touch]: A creature that you can touch regains HP equal to your Smarts.","[Craft Healing]: Once per long rest you can craft a healing item with components scavenged from plants or animals. The medical item crafted must be worth less than 500 credits. At level 5 you may create 2 items per long rest."]
},
{
    "name":"Witch Doctor",
    "hp":2,
    "sp":2,
    "cp":6,
    "speed":0,
    "thresholds":[0,1,1],
    "data":["[Tonic Crafting]: You can now create tonics via the crafting chart below. If a Tonic provides an effect it will last for 1 turn. Tonics can be thrown or consumed.","[Splash Tonics]: At the cost of additional CP, you can give a tonic an AOE effect. Every CP expended increases the AOE by 10 ft.","[Power Tonics]: At the cost of 1 CP, you can double the effects of a tonic. If the tonic has a duration, double the duration instead."]
},
{
    "name":"Engineer",
    "hp":4,
    "sp":3,
    "cp":3,
    "speed":0,
    "thresholds":[0,1,1],
    "data":["[Improvised Tools - 1 CP]: Craft a single tool worth less than 150 Credits. Once used, roll a 1d6. If the result is higher or equal than your Smarts, then the tool will break.","[Laser Turret - 2 CP]: Create a laser turret that is hostile to creatures of your choice. The Turret cannot be moved, and will break an hour after its creation. During combat, this turret will attack on your turn. At level 7, your laser turret is considered a heavy laser turret.","[Skilled Repaired]: When you take the repair action, you heal double the result and instantly repair a weapon regardless of the outcome of the roll.","[Makeshift Weapon]: Once per long rest you may salvage a weapon and replicate a primary attack, special attack, or crit effect. The range of the attack will be based on the weapon it was salvaged from. The weapon will use either Smarts, Agility, or Anger to attack. The upkeep cost of the weapon is based on the highest of the weapon salvaged."]
},
{
    "name":"Technopath",
    "hp":3,
    "sp":2,
    "cp":5,
    "speed":0,
    "thresholds":[1,0,1],
    "data":["[Psionic Lash - 1 CP; 30ft; Sight]: Make a contesting Smarts check against a creature, on a success deal mental damage equal to 2d6 plus your Smarts, on a failure deal half as much.","[Psionic Shove - 2 CP; 30ft; Sight]: Roll a contesting Smarts check against a creature, on a success move the creature feet equal to your Smarts multiplied by 5.","[Telekinesis - 1 CP; 30ft; Sight]: Move an object feet equal to your Smarts multiplied by 5. The object must be less than 20lbs * your Smarts, if the object collides with a creature it must make a Agility check of 4+ or take 2d6 bludgeoning damage."]
},
{
    "name":"Assassin",
    "hp":3,
    "sp":4,
    "cp":3,
    "speed":5,
    "thresholds":[0,2,0],
    "data":["[Analyze - 2 CP]: Learn the weaknesses, and resistances, and the stats of a target. At level 5 this ability will allow you to ignore any resistances of the target until the end of combat.","[Camouflage - 1 CP]: When you are not within melee range of an enemy, immediately hide from all creatures making them unaware of your presence.","[Stealth Attack]: When you attack an unaware creature, you deal an additional 1d6 damage. At level 4 it increases to 2d6. At level 7 it increases to 3d6."]
},
{
    "name":"Swarm Survivor",
    "hp":4,
    "sp":4,
    "cp":2,
    "speed":0,
    "thresholds":[2,0,0],
    "data":["[Overwhelmed - 2 CP]: Every creature within 15 ft of you will give you 2 TP, and an additional 1 Prowess to your next attack.","[Sweeping Strike]: Melee attacks now target all enemies in the radius of your melee weapon’s range.","[Horde Slayer]: Creatures with max HP less than your max HP take double damage from your attacks. At level 5 these creatures will no longer be resistant to your attacks."]
},
{
    "name":"Scoundrel",
    "hp":3,
    "sp":3,
    "cp":4,
    "speed":10,
    "thresholds":[1,1,0],
    "data":["[Vehicle Sapper - 1 CP]: On a successful attack against a vehicle, deal an additional 1d6 damage. At level 5 deal 2d6 additional damage.","[Vehicle Overclock - 2 CP]: Until the end of combat increase the EP of the vehicle you are piloting equal to half your level rounded up.","[Never Tell Me The Odds] Once per long rest you may reroll a check and take the higher of the 2 outcomes. At level 4 you may use this ability twice per long rest. At level 7 you may use this ability 3 times."]
},
{
    "name":"Warrior",
    "hp":6,
    "sp":2,
    "cp":2,
    "speed":0,
    "thresholds":[1,0,2],
    "data":["[Shrug it Off - 1 CP]: When you take any damage you can instead choose to take no damage.","[Taunt - 1 CP; 30ft; Sight]: Give a creature the taunted condition.","[Fury]: Twice per long rest you may gain the fury condition for 1 hour or until you release the effect. At level 5 you may use this ability 3 times per long rest. At level 7 this becomes empowered fury."]
},
{
    "name":"Demolitionist",
    "hp":4,
    "sp":2,
    "cp":4,
    "speed":0,
    "thresholds":[0,1,1],
    "data":["[Explosives Crafting]: You can now create explosives and apply any properties to the device via the chart below.  If a property provides an effect it will last for 1 turn. By default all explosive devices have an AOE of 15 ft. Crafted explosives take 2 turns to detonate, but the time may be increased before being thrown. Effects may also be stacked up to a maximum of 3 times.","[Packed Powder]: At the cost of additional CP, you can increase the AOE of your explosive device. Every CP expended increases the AOE by 15 ft."]
},
{
    "name":"Bodyguard",
    "hp":5,
    "sp":2,
    "cp":3,
    "speed":0,
    "thresholds":[1,1,1],
    "data":["[Guard - 1 CP]: Give all allies within 5ft of you and yourself 1 AC for 1 turn. At level 5 this increases to 2 AC.","[Eternal Defense - 2 CP]: Give an ally you can touch the Soul Guard condition.","[Protector]: If an ally within 10 ft of you is attacked, swap places with them and take the attack instead. This can only be done once per turn. At level 3 this can be done twice. At level 7 this may be done three times."]
}
]
}